"""ch4_pr01.py
キーボードから季節（春・夏・秋・冬）のどれかを漢字で入力させ、その季節にあるイベントを表示しましょう。
"""
# 変数seasonに、キーボードから入力した文字列を代入する。入力させる際は"季節を入力してください："と表示する。
season=input("季節を入力してください")

# もしseasonに"春"が代入されていれば
if season=="春":
    
    # 春のイベントを表示する
    print("お花見")
# でなければもし、seasonに"夏"が代入されていれば
elif season=="夏":
    # 夏のイベントを表示する
    print("お祭り")
# でなければもし、seasonに"秋"が代入されていれば
elif season=="秋":
    # 秋のイベントを表示する
    print("ハロウィン")
# でなければもし、seasonに"冬"が代入されていれば
elif season=="冬":
    # 冬のイベントを表示する
    print("お正月")
# でなければ
else:
    # "イベントはありません"と表示する
    print("イベントはありません")