"""ch16_pr12.py
次の条件に当てはまるプログラムを作りましょう。

＜条件＞
モンスターを作るMonsterクラス、スライムを作るSlimeクラス、ドラゴンを作るDragonクラスの3つを以下のように定義する。

【Monsterクラス】
・名前（name）、体力（hp）のデータを持つ。
・attackメソッドが呼び出されたら、"〇〇（名前）がかみついた！"と出力する。
・take_damageメソッドが呼び出されたら、引数に与えられたダメージ（dmg）を使い
　"〇〇（名前）は〇〇ダメージ受けた！残りHPは〇〇"と出力する。

【Slimeクラス】
・名前（name）、体力（hp）のデータを持つ。
・attackメソッドが呼び出されたら、"〇〇（名前）がかみついた！"と出力する。
・splitメソッドが呼び出されたら"〇〇（名前）が分裂した！"と出力する。
・take_damageメソッドが呼び出されたら、引数に与えられたダメージ（dmg）を使い
　"〇〇（名前）は〇〇ダメージ受けた！残りHPは〇〇"と出力する。

【Dragonクラス】
・名前（name）、体力（hp）、属性（element）のデータを持つ。
・attackメソッドが呼び出されたら、"〇〇（名前）がかみついた！"と出力したあと、
　"〇〇（名前）が〇〇（属性）を吐いた！"と出力する。
・take_damageメソッドが呼び出されたら、引数に与えられたダメージ（dmg）を使い
　"〇〇（名前）は〇〇ダメージ受けた！残りHPは〇〇"と出力する。
"""

# Monsterクラス



# Slimeクラス



# Dragonクラス



# インスタンス化

