"""ch15_pr02.py
1日6組限定の人気レストランがあります。このレストランの予約システムを作りましょう。
現在の予約状況は次のような二次元リストで表されます。

restaurant = [
    ["予約済み", "予約済み", "空席"] , # 1行目
    ["予約済み", "空席", "予約済み"]   # 2行目
]

シェルから行（0〜1）と列（0〜2）を入力させ、指定された席が"空席"であれば"予約済み"に変更し、
すでに"予約済み"であれば"その席は予約済みです"と出力するプログラムを作りましょう。
ただし、入力が無効な場合でもエラーは出さず、"入力が無効です"と出力してください。
"""

# 現在の予約状況
restaurant = [
    ["予約済み", "予約済み", "空席"],  # 1行目
    ["予約済み", "空席", "予約済み"]   # 2行目
]

# 処理前の座席を表示



# 例外処理

    # 行を入力させる


    # 列を入力させる


    # もし空席であれば

        # 予約済みにする


    # でなければ

        # "その席は予約済みです"と出力する


# 入力が無効の場合


# 処理後の座席を表示
